app/controllers/calendar_controller.rb

SELECT * FROM `privileges` INNER JOIN `privileges_users` ON `privileges`.id = `privileges_users`.privilege_id WHERE (`privileges_users`.user_id = 1 )
SELECT `events`.* FROM `events` LEFT OUTER JOIN finance_fee_collections ffc ON ffc.id = origin_id AND origin_type = 'FinanceFeeCollection'
---
  def index
    privilege = current_user.privileges.map{|p| p.name}
    @user = current_user
    if params[:new_month].nil?
      @show_month = @local_tzone_time.to_date
    else
      passed_date = (params[:passed_date]).to_date
      if params[:new_month].to_i > passed_date.month
        @show_month  = passed_date+1.month
      else
        @show_month = passed_date-1.month
      end
    end
    @start_date = @show_month.beginning_of_month
    @start_date_day = @start_date.wday
    @last_day = @show_month.end_of_month
    @notifications = Hash.new{|h,k| h[k]=Array.new}
    first_day = @show_month.beginning_of_month.beginning_of_day
    last_day =  @show_month.end_of_month.end_of_day
    if @user.admin? or privilege.include?("EventManagement")
      @events = Event.all(:conditions =>["((ffc.id IS NULL OR (fa_fc.id IS NULL OR fa_fc.is_deleted = false)) AND
                          (hfc.id IS NULL OR (fa_hfc.id IS NULL OR fa_hfc.is_deleted = false)) AND
                          (tfc.id IS NULL OR (fa_tfc.id IS NULL OR fa_tfc.is_deleted = false))) AND
                          ((events.start_date BETWEEN ? AND ?) or (events.end_date BETWEEN ? AND ?) or
                          (? BETWEEN events.start_date AND events.end_date) or (? BETWEEN events.start_date AND events.end_date))",
                          first_day,last_day,first_day,last_day,first_day,last_day],:include=>[:origin],
        :joins => "LEFT OUTER JOIN finance_fee_collections ffc ON ffc.id = origin_id AND origin_type = 'FinanceFeeCollection'
                   LEFT OUTER JOIN fee_accounts fa_fc ON fa_fc.id = ffc.fee_account_id
                   LEFT OUTER JOIN hostel_fee_collections hfc ON hfc.id = origin_id AND origin_type = 'HostelFeeCollection'
                   LEFT OUTER JOIN fee_accounts fa_hfc ON fa_hfc.id = hfc.fee_account_id
                   LEFT OUTER JOIN transport_fee_collections tfc ON tfc.id = origin_id AND origin_type = 'TransportFeeCollection'
                   LEFT OUTER JOIN fee_accounts fa_tfc ON fa_tfc.id = tfc.fee_account_id")